from PyQt5.QtCore import Qt, QTimer, QTime, QLocale
win_x, win_y = 200, 100
win_width, win_height = 1000, 600

txt_hello = 'Добро пордаловат в пограмму для проверки состояние здоровья '
txt_next = 'Start'
txt_instruction = '''Данное приложение поможет сделать диагностику своего здоровье через тест Руфье./n'
                    'Тест Руфье предостовляет собой нагрузочный комплекс, предозначен для работы сердца при физической нагрузки./n'
                    'У испытуемого, находящегося в положения лежа на спине в течение 5 минут, определяет чистоту пульса за 15 секунд./n'
                    'Затем в течение 45 секунд испытуемый выполняет 30 пресиданий./n'
                    'После окончания нагрузки испытуемый ложиться на спину, и вновь у него подсчитывается число пульсаций за первые 15 секунд./n'
                    "А потом за последние 15 секунд  первой минуты период востоновления./n"
                    "Важно если вы почустуваете себя плохо по время испытаний, То вам следует первать испытание и пойти к врачу'''
txt_title = 'Здоровье'
txt_name = 'Введите ваше Ф.И.О'
txt_hintname = "Ф.И.О"
txt_hintage = "0"
txt_test1 = 'Лягте на спину и  измерте пульс за 15 секунд. Нажмите на кнопку "Начните первый тест" Чтобы запустить такймер./n Рузультат запишите в соответствующее поле'
txt_test2 = ''
txt_test3 = ''
txt_sendresults = ''
txt_hinttest1 = '0'
txt_hinttest2 = '0'
txt_hinttest3 = '0'
txt_starttest1 = 'Начать первый тест '
txt_starttest2 = 'Начать второй тест '
txt_starttest3 = 'Начать третий тест'
time = QTime(0, 0, 15)
txt_timer = time.toString("hh:mm:ss")
txt_age = 'Ваш возраст'
txt_finalwin = 'Результаты'
txt_index = 'Индекс Руфье'
txt_workheart = 'Работоспособность сердца:'
txt_res1 = "Низкая, Вам нужно быстро обротиться к врачу"
txt_res2 = "Нормальная но обратитесь к врачу"
txt_res3 = "Средняя. Вам стоит пойти к доктору"
txt_res4 = "Выше среднего "
txt_res5 = "Высокая "